In [1]:
import pandas as pd
import numpy as np

In [49]:
df1=pd.DataFrame({"A":[11,22,33,44],"B":[33,44,55,44],"C":[55,66,22,55]})

In [50]:
df1

    A   B   C
0  11  33  55
1  22  44  66
2  33  55  22
3  44  44  55

In [11]:
df1["C"].unique()

array([55, 66, 77], dtype=int64)

tells the unique elements

In [16]:
df1["C"].nunique()

3

tells the number of unique elements

In [17]:
len(df1['C'].unique())

3

In [18]:
df1["C"].value_counts()

55    2
66    1
77    1
Name: C, dtype: int64

combines both the above operations

In [19]:
df1

    A   B   C
0  11  33  55
1  22  44  66
2  33  55  77
3  44  44  55

In [20]:
df1["A"]

0    11
1    22
2    33
3    44
Name: A, dtype: int64

In [26]:
def square(x):
    return x**2

In [27]:
df1["A"].apply(square)

0     121
1     484
2    1089
3    1936
Name: A, dtype: int64

In [29]:
df1["A"].apply(lambda x:x*2)

0    22
1    44
2    66
3    88
Name: A, dtype: int64

In [30]:
df1["A"].apply(lambda x:x+5)

0    16
1    27
2    38
3    49
Name: A, dtype: int64

selecting data is a major role in data science so we use the apply functions plus the lambda expressions which we learnt in the python crash course

In [31]:
df1.drop("A",axis=1)

    B   C
0  33  55
1  44  66
2  55  77
3  44  55

In [32]:
df

NameError: name 'df' is not defined

In [34]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [40]:
 df1.index

RangeIndex(start=0, stop=4, step=1)

In [51]:
df1

    A   B   C
0  11  33  55
1  22  44  66
2  33  55  22
3  44  44  55

In [53]:
df1.sort_values(by=2,axis=1)

    C   A   B
0  55  11  33
1  66  22  44
2  22  33  55
3  55  44  44

In [55]:
df1.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

didnt do pivot tables